shelly-tang/YareLampGo_esp32/ESP32_P4_HEAD/device_http.cpp
// SPDX-FileCopyrightText: 2026 LampGo contributors
// SPDX-License-Identifier: GPL-3.0-only

#include "device_http.h"

#include <LittleFS.h>
#include <Preferences.h>
#include <WiFi.h>
#include <esp_heap_caps.h>

#if __has_include(<esp32-hal-hosted.h>)
#include <esp32-hal-hosted.h>
#define LAMPGO_HAS_ESP_HOSTED_DIAGNOSTICS 1
#else
#define LAMPGO_HAS_ESP_HOSTED_DIAGNOSTICS 0
#endif

#include "board_config.h"
#include "motion_protocol.h"

namespace {
constexpr size_t kMaxEyeBytes = 512 * 1024;
constexpr size_t kMaxLedBytes = 8 * 1024;
constexpr char kContentTypeHeader[] = "Content-Type";
constexpr char kOwnerHeader[] = "X-Lampgo-Owner";
constexpr char kAuthPurposeHeader[] = "X-Lampgo-Auth-Purpose";
constexpr char kAuthNonceHeader[] = "X-Lampgo-Auth-Nonce";
constexpr char kAuthProofHeader[] = "X-Lampgo-Auth-Proof";
constexpr char kClipIdHeader[] = "X-Lampgo-Clip-Id";
constexpr char kEffectIdHeader[] = "X-Lampgo-Effect-Id";
constexpr char kUploadPhaseHeader[] = "X-Lampgo-Upload-Phase";

void addHostedDiagnostics(JsonDocument& response) {
  JsonObject hosted = response["hosted"].to<JsonObject>();
  hosted["internal_dma_free"] = heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
  hosted["internal_dma_largest"] =
      heap_caps_get_largest_free_block(MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);
  hosted["internal_dma_low_water"] =
      heap_caps_get_minimum_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_DMA);

#if LAMPGO_HAS_ESP_HOSTED_DIAGNOSTICS
  uint32_t hostMajor = 0;
  uint32_t hostMinor = 0;
  uint32_t hostPatch = 0;
  uint32_t slaveMajor = 0;
  uint32_t slaveMinor = 0;
  uint32_t slavePatch = 0;
  hostedGetHostVersion(&hostMajor, &hostMinor, &hostPatch);
  hostedGetSlaveVersion(&slaveMajor, &slaveMinor, &slavePatch);
  hosted["initialized"] = hostedIsInitialized();
  hosted["host_version"] = String(hostMajor) + "." + String(hostMinor) + "." + String(hostPatch);
  hosted["slave_version"] = String(slaveMajor) + "." + String(slaveMinor) + "." + String(slavePatch);
#else
  hosted["initialized"] = false;
  hosted["host_version"] = "unavailable";
  hosted["slave_version"] = "unavailable";
#endif
}

uint32_t parseColor(String value) {
  value.trim();
  if (value.startsWith("#")) value.remove(0, 1);
  if (value.length() != 6) return 0xFFFFFF;
  char* end = nullptr;
  const uint32_t result = strtoul(value.c_str(), &end, 16);
  return end && *end == '\0' ? result : 0xFFFFFF;
}
}  // namespace

DeviceHttp::DeviceHttp(PairingStore& pairing, ServoExecutor& servos,
                       ExpressionCoordinator& expressions, CameraController& camera,
                       AudioBridge& audio, AssetUploadServer& assets, const String& hostname)
    : pairing_(pairing), servos_(servos), expressions_(expressions), camera_(camera),
      audio_(audio), assets_(assets), hostname_(hostname), server_(BoardConfig::kHttpPort) {}

void DeviceHttp::begin() {
  // Raw body callbacks run before WebServer parses query arguments.  Retain
  // the headers that identify the paired owner and target asset.
  const char* headers[] = {kContentTypeHeader, kOwnerHeader, kAuthPurposeHeader,
                           kAuthNonceHeader, kAuthProofHeader, kClipIdHeader,
                           kEffectIdHeader, kUploadPhaseHeader};
  server_.collectHeaders(headers, 8);
  registerRoutes();
  server_.begin();
  Serial.printf("[HTTP READY] http://%s/\n", hostname_.c_str());
}

void DeviceHttp::loop() {
  server_.handleClient();
  if (restartAtMs_ != 0 && static_cast<int32_t>(millis() - restartAtMs_) >= 0) {
    Serial.println("[HTTP] restarting now");
    delay(50);
    ESP.restart();
  }
}

void DeviceHttp::registerRoutes() {
  server_.on("/", HTTP_GET, [this]() {
    server_.send(200, "text/plain; charset=utf-8",
                 "LampGo ESP32-P4 head board\nGET /device/status\nPOST /api/wifi\n");
  });
  server_.on("/device/status", HTTP_GET, [this]() { handleStatus(); });
  server_.on("/status", HTTP_GET, [this]() { handleProvisionStatus(); });
  server_.on("/scan", HTTP_GET, [this]() { handleScan(); });
  server_.on("/connect", HTTP_POST, [this]() { handleConnect(); });
  server_.on("/config", HTTP_GET, [this]() { handleConfigRead(); });
  server_.on("/config", HTTP_POST, [this]() { handleConfig(); });
  server_.on("/device/config", HTTP_GET, [this]() { handleConfigRead(); });
  server_.on("/device/config", HTTP_POST, [this]() { handleConfig(); });
  server_.on("/device/auth/challenge", HTTP_GET, [this]() { handleAuthChallenge(); });
  server_.on("/capture", HTTP_GET, [this]() { camera_.sendJpeg(server_); });
  server_.on("/device/pair", HTTP_POST, [this]() { handlePair(); });
  server_.on("/device/unpair", HTTP_POST, [this]() { handleUnpair(); });
  server_.on("/device/claim", HTTP_POST, [this]() { handleClaim(); });
  server_.on("/device/release", HTTP_POST, [this]() { handleClaim(); });
  server_.on("/device/led", HTTP_GET, [this]() { handleLedStatus(); });
  server_.on("/device/led", HTTP_POST, [this]() { handleLed(); });
  server_.on("/device/expressions/play", HTTP_POST, [this]() { handleExpressionPlay(); });
  server_.on("/device/expressions/stop", HTTP_POST, [this]() { handleExpressionStop(); });
  server_.on("/device/expression-clips", HTTP_GET,
             [this]() { handleAssetList(UploadKind::kEye); });
  server_.on("/device/expression-clips/delete", HTTP_POST,
             [this]() { handleAssetDelete(UploadKind::kEye); });
  server_.on(
      "/device/expression-clips/upload", HTTP_POST,
      [this]() { finishUploadRequest(UploadKind::kEye); },
      [this]() { handleUploadData(UploadKind::kEye); });
  server_.on("/device/led-effects", HTTP_GET,
             [this]() { handleAssetList(UploadKind::kLed); });
  server_.on("/device/led-effects/delete", HTTP_POST,
             [this]() { handleAssetDelete(UploadKind::kLed); });
  server_.on(
      "/device/led-effects/upload", HTTP_POST,
      [this]() { finishUploadRequest(UploadKind::kLed); },
      [this]() { handleUploadData(UploadKind::kLed); });
  server_.on("/device/clock", HTTP_POST, [this]() { handleClock(); });
  server_.on("/api/wifi", HTTP_POST, [this]() { handleConnect(); });
  server_.on("/device/forget-wifi", HTTP_POST, [this]() { handleForgetWifi(); });
  server_.on("/device/reboot", HTTP_POST, [this]() { handleReboot(); });
  server_.on("/api/servos", HTTP_GET, [this]() { handleServoStatus(); });
  server_.onNotFound([this]() { sendError(404, "not found"); });
}

