shelly-tang/YareLampGo_esp32/ESP32_P4_HEAD/device_http.cpp
void DeviceHttp::handleProvisionStatus() {
  Preferences preferences;
  preferences.begin("lampgo-net", true);
  const bool configured = !preferences.getString("ssid", "").isEmpty();
  preferences.end();

  uint8_t mac[6]{};
  WiFi.macAddress(mac);
  char macText[18]{};
  snprintf(macText, sizeof(macText), "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1],
           mac[2], mac[3], mac[4], mac[5]);

  JsonDocument response;
  response["ok"] = true;
  response["configured"] = configured;
  response["mode"] = WiFi.status() == WL_CONNECTED ? "sta" : "ap_sta";
  response["mac"] = macText;
  response["hostname"] = hostname_;
  response["ap_ssid"] = String(BoardConfig::kSetupSsidPrefix) + hostname_.substring(hostname_.length() - 4);
  response["pairing_supported"] = true;
  response["paired"] = pairing_.isPaired();
  response["paired_owner_id"] = pairing_.ownerId();
  sendJson(200, response);
}

void DeviceHttp::handleScan() {
  const int16_t count = WiFi.scanNetworks(false, true);
  JsonDocument response;
  response["ok"] = count >= 0;
  response["scan_ok"] = count >= 0;
  response["scan_result"] = count;
  JsonArray networks = response["networks"].to<JsonArray>();
  for (int index = 0; index < count && index < 30; ++index) {
    JsonObject network = networks.add<JsonObject>();
    network["ssid"] = WiFi.SSID(index);
    network["rssi"] = WiFi.RSSI(index);
    network["bssid"] = WiFi.BSSIDstr(index);
    network["channel"] = WiFi.channel(index);
    const bool open = WiFi.encryptionType(index) == WIFI_AUTH_OPEN;
    network["open"] = open;
    network["encrypt"] = !open;
  }
  if (count < 0) response["error"] = "scan_failed";
  WiFi.scanDelete();
  sendJson(200, response);
}

void DeviceHttp::handleConnect() {
  JsonDocument request;
  if (!parseJson(request)) return;
  JsonObjectConst body = request.as<JsonObjectConst>();
  const String ssid = body["ssid"] | "";
  const String password = body["password"] | "";
  if (ssid.isEmpty() || ssid.length() > 32 || password.length() > 64) {
    sendError(400, "invalid WiFi credentials");
    return;
  }

  const bool wasPaired = pairing_.isPaired();
  String pairingError;
  if (!pairing_.pair(body["owner_id"] | "", body["owner_label"] | "",
                     body["pairing_secret"] | "", pairingError)) {
    sendError(pairing_.isPaired() ? 409 : 400, pairingError.c_str());
    return;
  }

  Preferences preferences;
  if (!preferences.begin("lampgo-net", false)) {
    if (!wasPaired) {
      pairing_.unpair(body["owner_id"] | "", body["pairing_secret"] | "");
    }
    sendError(500, "cannot open WiFi settings");
    return;
  }
  const String previousSsid = preferences.getString("ssid", "");
  const String previousPassword = preferences.getString("password", "");
  const bool saved = preferences.putString("ssid", ssid) > 0 &&
                     preferences.putString("password", password) == password.length();
  if (!saved) {
    if (previousSsid.isEmpty()) {
      preferences.clear();
    } else {
      preferences.putString("ssid", previousSsid);
      preferences.putString("password", previousPassword);
    }
  }
  preferences.end();
  if (!saved) {
    if (!wasPaired) {
      pairing_.unpair(body["owner_id"] | "", body["pairing_secret"] | "");
    }
    sendError(500, "cannot persist WiFi credentials");
    return;
  }

  JsonDocument response;
  response["ok"] = true;
  response["message"] = "restarting";
  response["paired"] = true;
  response["paired_owner_id"] = pairing_.ownerId();
  sendJson(200, response);
  scheduleRestart();
}

void DeviceHttp::handleStatus() {
  const ServoSnapshot snapshot = servos_.snapshot();
  JsonDocument response;
  response["ok"] = true;
  response["device_id"] = hostname_;
  response["hostname"] = hostname_;
  response["firmware"] = BoardConfig::kFirmwareVersion;
  response["platform"] = "esp32-p4";
  response["motion_port"] = BoardConfig::kMotionWsPort;
  response["asset_upload_port"] = BoardConfig::kAssetUploadPort;
  response["ip"] = WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
  response["network_mode"] = WiFi.status() == WL_CONNECTED ? "sta" : "softap";
  response["rssi"] = WiFi.status() == WL_CONNECTED ? WiFi.RSSI() : 0;
  response["pairing_supported"] = true;
  response["paired"] = pairing_.isPaired();
  response["pairing_state"] = pairing_.isPaired() ? "paired" : "unpaired";
  response["paired_owner_id"] = pairing_.ownerId();
  response["paired_owner_label"] = pairing_.ownerLabel();
  response["free_heap"] = ESP.getFreeHeap();
  response["free_psram"] = ESP.getFreePsram();
  addHostedDiagnostics(response);
  response["mic_streaming"] = audio_.microphoneReady() && audio_.microphoneEnabled();
  response["wake_ready"] = false;
  response["wake_event_clients"] = 0;
  response["audio_profile"] = audio_.profile();
  response["wake_model"] = "";
  response["wake_requested_model"] = "";
  response["wake_supported_models"].to<JsonArray>();
  JsonObject audio = response["audio"].to<JsonObject>();
  audio["sample_rate"] = BoardConfig::kAudioSampleRate;
  audio["ws_port"] = BoardConfig::kAudioWsPort;
  audio["microphone_ready"] = audio_.microphoneReady();
  audio["microphone_enabled"] = audio_.microphoneEnabled();
  audio["speaker_ready"] = audio_.speakerReady();
  audio["aec_ready"] = audio_.aecReady();
  audio["aec_enabled"] = audio_.aecEnabled();
  audio["speaker_volume"] = audio_.speakerVolume();
  audio["mic_frames"] = audio_.micFrames();
  audio["speaker_packets"] = audio_.speakerPackets();
  audio["speaker_drops"] = audio_.speakerDrops();
  audio["ws_clients"] = audio_.audioClientCount();
  audio["ws_connections"] = audio_.audioConnections();
  audio["ws_frames_queued"] = audio_.audioFramesQueued();
  audio["ws_frames_sent"] = audio_.audioFramesSent();
  audio["ws_send_failures"] = audio_.audioSendFailures();
  audio["ws_queue_failures"] = audio_.audioQueueFailures();
  audio["ws_auth_failures"] = audio_.audioAuthFailures();
  response["led_ready"] = expressions_.ledReady();
  response["led_mode"] = expressions_.currentMode();
  response["led_brightness"] = expressions_.currentBrightness();
  response["led_driver"] = "p4-rmt-direct";
  response["led_pixel_pin"] = BoardConfig::kLedData;
  response["led_pixel_count"] = BoardConfig::kLedCount;
  response["led_width"] = BoardConfig::kLedWidth;
  response["led_height"] = BoardConfig::kLedHeight;
  response["led_panel_count"] = 1;
  response["led_output_ok"] = expressions_.ledReady();
  response["lcd_width"] = BoardConfig::kLcdWidth;
  response["lcd_height"] = BoardConfig::kLcdHeight;
  response["lcd_ready"] = expressions_.displayReady();
  JsonObject capabilities = response["capabilities"].to<JsonObject>();
  capabilities["motion_ws"] = true;
  capabilities["asset_upload_port"] = BoardConfig::kAssetUploadPort;
  capabilities["servo_count"] = BoardConfig::kServoCount;
  capabilities["led_pixels"] = BoardConfig::kLedCount;
  capabilities["lcd_width"] = BoardConfig::kLcdWidth;
  capabilities["lcd_height"] = BoardConfig::kLcdHeight;
  capabilities["lcd_ready"] = expressions_.displayReady();
  capabilities["camera"] = camera_.ready();
  capabilities["microphone"] = audio_.microphoneReady();
  capabilities["speaker"] = audio_.speakerReady();
  capabilities["aec"] = audio_.aecReady();
  capabilities["wake_word"] = false;
  addServoStatus(response["servos"].to<JsonObject>(), snapshot);
  sendJson(200, response);
}

void DeviceHttp::handleConfigRead() {
  JsonDocument response;
  response["ok"] = true;
  response["platform"] = "esp32-p4";
  response["audio_profile"] = audio_.profile();
  response["speaker_volume"] = audio_.speakerVolume();
  response["mic_enabled"] = audio_.microphoneEnabled();
  response["aec_ready"] = audio_.aecReady();
  response["aec_enabled"] = audio_.aecEnabled();
  response["wake_word_supported"] = false;
  response["wake_model"] = "";
  response["wake_requested_model"] = "";
  response["wake_supported_models"].to<JsonArray>();
  response["camera_ready"] = camera_.ready();
  response["jpeg_quality"] = camera_.jpegQuality();
  response["camera_width"] = camera_.width();
  response["camera_height"] = camera_.height();
  response["framesize_fixed"] = true;
  sendJson(200, response);
}

void DeviceHttp::handleAuthChallenge() {
  const String purpose = server_.arg("purpose");
  if (!purpose.startsWith("http:POST:/") && !purpose.startsWith("asset:POST:/")) {
    sendError(400, "invalid authentication purpose");
    return;
  }
  const String nonce = pairing_.issueChallenge(purpose);
  if (nonce.isEmpty()) {
    sendError(403, pairing_.isPaired() ? "cannot issue authentication challenge" : "device is not paired");
    return;
  }
  JsonDocument response;
  response["ok"] = true;
  response["purpose"] = purpose;
  response["nonce"] = nonce;
  sendJson(200, response);
}

