shelly-tang/YareLampGo_esp32/ESP32_P4_HEAD/device_http.cpp
void DeviceHttp::handleConfig() {
  JsonDocument request;
  if (!parseJson(request)) return;
  JsonObjectConst body = request.as<JsonObjectConst>();
  if (!authorize(body)) {
    sendError(403, "pairing mismatch");
    return;
  }
  if (!body["audio_profile"].isNull() &&
      !audio_.setProfile(String(body["audio_profile"] | ""))) {
    sendError(400, "unsupported audio profile");
    return;
  }
  if (!body["speaker_volume"].isNull()) {
    audio_.setSpeakerVolume(body["speaker_volume"].as<float>());
  }
  if (!body["mic_enabled"].isNull()) {
    audio_.setMicrophoneEnabled(body["mic_enabled"].as<bool>());
  }
  if (!body["jpeg_quality"].isNull() &&
      !camera_.setJpegQuality(body["jpeg_quality"].as<uint8_t>())) {
    sendError(400, "jpeg_quality must be 4..63");
    return;
  }
  JsonDocument response;
  response["ok"] = true;
  response["audio_profile"] = audio_.profile();
  response["aec_ready"] = audio_.aecReady();
  response["aec_enabled"] = audio_.aecEnabled();
  response["mic_enabled"] = audio_.microphoneEnabled();
  response["speaker_volume"] = audio_.speakerVolume();
  response["jpeg_quality"] = camera_.jpegQuality();
  response["camera_width"] = camera_.width();
  response["camera_height"] = camera_.height();
  response["framesize_fixed"] = true;
  response["wake_word_supported"] = false;
  sendJson(200, response);
}

void DeviceHttp::handlePair() {
  JsonDocument request;
  if (!parseJson(request)) return;
  JsonObjectConst body = request.as<JsonObjectConst>();
  String error;
  if (!pairing_.pair(body["owner_id"] | "", body["owner_label"] | "",
                     body["pairing_secret"] | "", error)) {
    sendError(409, error.c_str());
    return;
  }
  JsonDocument response;
  response["ok"] = true;
  response["paired"] = true;
  response["paired_owner_id"] = pairing_.ownerId();
  response["pairing_supported"] = true;
  sendJson(200, response);
}

void DeviceHttp::handleUnpair() {
  JsonDocument request;
  if (!parseJson(request)) return;
  JsonObjectConst body = request.as<JsonObjectConst>();
  if (!authorize(body) || !pairing_.clear()) {
    sendError(403, "pairing mismatch");
    return;
  }
  expressions_.stop();
  JsonDocument response;
  response["ok"] = true;
  response["paired"] = false;
  sendJson(200, response);
}

void DeviceHttp::handleClaim() {
  JsonDocument request;
  if (!parseJson(request)) return;
  if (!authorize(request.as<JsonObjectConst>())) {
    sendError(403, "pairing mismatch");
    return;
  }
  JsonDocument response;
  response["ok"] = true;
  response["owner_id"] = pairing_.ownerId();
  response["ttl_ms"] = 120000;
  sendJson(200, response);
}

void DeviceHttp::handleLed() {
  JsonDocument request;
  if (!parseJson(request)) return;
  JsonObjectConst body = request.as<JsonObjectConst>();
  if (!authorize(body)) {
    sendError(403, "pairing mismatch");
    return;
  }
  const String diagnostic = body["diagnostic"] | "";
  if (diagnostic == "topology") {
    expressions_.showLedTopologyTest(body["brightness"] | 8);
  } else if (!body["enabled"].isNull() && !body["enabled"].as<bool>()) {
    expressions_.stop();
  } else if (!body["expression"].isNull() || !body["mode"].isNull() ||
             !body["led_mode"].isNull() || !body["clip_id"].isNull()) {
    const String expression = body["expression"] | "focused";
    const int mode = !body["mode"].isNull() ? body["mode"].as<int>() :
                     !body["led_mode"].isNull() ? body["led_mode"].as<int>() : -1;
    const uint8_t brightness = body["brightness"] | BoardConfig::kLedSafeBrightness;
    const String eye = body["clip_id"] | "";
    if (!expressions_.play(expression, mode, eye, "", brightness, true)) {
      sendError(400, "invalid expression");
      return;
    }
  } else if (!body["brightness"].isNull()) {
    expressions_.setBrightness(body["brightness"].as<uint8_t>());
  }
  JsonDocument response;
  response["ok"] = true;
  response["mode"] = expressions_.currentMode();
  if (diagnostic == "topology") response["diagnostic"] = "topology";
  sendJson(200, response);
}

void DeviceHttp::handleLedStatus() {
  JsonDocument response;
  response["ok"] = true;
  response["mode"] = expressions_.currentMode();
  response["brightness"] = expressions_.currentBrightness();
  response["eye_clip_id"] = expressions_.currentEyeClip();
  response["led_effect_id"] = expressions_.currentLedEffect();
  sendJson(200, response);
}

void DeviceHttp::handleClock() {
  JsonDocument request;
  if (!parseJson(request)) return;
  JsonObjectConst body = request.as<JsonObjectConst>();
  if (!authorize(body)) {
    sendError(403, "pairing mismatch");
    return;
  }
  if (!body["enabled"].isNull() && !body["enabled"].as<bool>()) {
    expressions_.stop();
  } else {
    expressions_.showClock(body["hour"] | 0, body["minute"] | 0,
                           parseColor(String(body["color"] | "#ffffff")),
                           body["brightness"] | BoardConfig::kLedSafeBrightness);
  }
  JsonDocument response;
  response["ok"] = true;
  sendJson(200, response);
}

void DeviceHttp::handleExpressionPlay() {
  JsonDocument request;
  if (!parseJson(request)) return;
  JsonObjectConst body = request.as<JsonObjectConst>();
  if (!authorize(body)) {
    sendError(403, "pairing mismatch");
    return;
  }
  const String preset = body["preset_id"] | "";
  const String expression = preset.isEmpty() ? String(body["expression"] | "focused") : preset;
  const int mode = !body["led_mode"].isNull() ? body["led_mode"].as<int>() : -1;
  const String eye = body["eye_clip_id"] | "";
  const String led = body["led_effect_id"] | "";
  JsonObjectConst ledParams = body["led_params"].as<JsonObjectConst>();
  const uint8_t brightness = ledParams["brightness"] | BoardConfig::kLedSafeBrightness;
  const String playback = body["playback"] | "loop";
  if (!expressions_.play(expression, mode, eye, led, brightness, playback != "once")) {
    sendError(400, "invalid expression composition");
    return;
  }
  JsonDocument response;
  response["ok"] = true;
  response["started_at_ms"] = millis();
  response["display_confirmed"] = true;
  sendJson(200, response);
}

void DeviceHttp::handleExpressionStop() {
  JsonDocument request;
  if (!parseJson(request)) return;
  if (!authorize(request.as<JsonObjectConst>())) {
    sendError(403, "pairing mismatch");
    return;
  }
  expressions_.stop();
  JsonDocument response;
  response["ok"] = true;
  sendJson(200, response);
}

void DeviceHttp::handleAssetList(UploadKind kind) {
  JsonDocument response;
  response["ok"] = true;
  JsonArray assets = response["result"][kind == UploadKind::kEye ? "expression_clips" : "led_effects"]
                         .to<JsonArray>();
  File root = LittleFS.open("/");
  File file = root.openNextFile();
  const String prefix = kind == UploadKind::kEye ? "/eye_" : "/led_";
  while (file) {
    const String name = file.name();
    if (name.startsWith(prefix) && name.endsWith(".bin")) {
      JsonObject asset = assets.add<JsonObject>();
      asset[kind == UploadKind::kEye ? "clip_id" : "effect_id"] =
          name.substring(prefix.length(), name.length() - 4);
      asset["bytes"] = file.size();
    }
    file = root.openNextFile();
  }
  sendJson(200, response);
}

void DeviceHttp::handleAssetDelete(UploadKind kind) {
  JsonDocument request;
  if (!parseJson(request)) return;
  JsonObjectConst body = request.as<JsonObjectConst>();
  if (!authorize(body)) {
    sendError(403, "pairing mismatch");
    return;
  }
  const String id = kind == UploadKind::kEye ? String(body["clip_id"] | "") :
                                               String(body["effect_id"] | "");
  if (!ExpressionCoordinator::safeAssetId(id)) {
    sendError(400, "invalid asset id");
    return;
  }
  JsonDocument response;
  response["ok"] = LittleFS.remove(assetPath(kind, id));
  sendJson(response["ok"].as<bool>() ? 200 : 404, response);
}

void DeviceHttp::handleUploadData(UploadKind kind) {
  const String phase = server_.header(kUploadPhaseHeader);
  if (!phase.isEmpty()) {
    HTTPRaw& raw = server_.raw();
    const String id = kind == UploadKind::kEye ? server_.header(kClipIdHeader) :
                                                 server_.header(kEffectIdHeader);
    if (phase == "start") {
      if (raw.status == RAW_START) {
        startUpload(kind, id, authorizeRequest(String("asset:POST:") + server_.uri() + ":start"));
      } else if (raw.status == RAW_WRITE && raw.currentSize != 0) {
        uploadOk_ = false;
        uploadError_ = "start body must be empty";
      } else if (raw.status == RAW_ABORTED) {
        endUpload(kind, true);
      }
    } else if (phase == "chunk") {
      if (raw.status == RAW_START) {
        if (!authorizeRequest(String("asset:POST:") + server_.uri() + ":chunk") || !uploadOk_ || kind != uploadKind_ || id != uploadId_ || !uploadFile_) {
          uploadOk_ = false;
          uploadError_ = "no matching asset upload";
        }
      } else if (raw.status == RAW_WRITE) {
        appendUpload(kind, raw.buf, raw.currentSize);
      } else if (raw.status == RAW_ABORTED) {
        endUpload(kind, true);
      }
    } else if (phase == "finish") {
      if (raw.status == RAW_START) {
        if (!authorizeRequest(String("asset:POST:") + server_.uri() + ":finish") || !uploadOk_ || kind != uploadKind_ || id != uploadId_ || !uploadFile_) {
          uploadOk_ = false;
          uploadError_ = "no matching asset upload";
        }
      } else if (raw.status == RAW_WRITE && raw.currentSize != 0) {
        uploadOk_ = false;
        uploadError_ = "finish body must be empty";
      } else if (raw.status == RAW_ABORTED) {
        endUpload(kind, true);
      }
    } else {
      uploadOk_ = false;
      uploadError_ = "invalid upload phase";
    }
    return;
  }

  if (!server_.header(kContentTypeHeader).startsWith("multipart/")) {
    HTTPRaw& raw = server_.raw();
    if (raw.status == RAW_START) {
      const String id = kind == UploadKind::kEye ? server_.header(kClipIdHeader) :
                                                   server_.header(kEffectIdHeader);
      startUpload(kind, id, authorizeRequest(String("asset:POST:") + server_.uri() + ":single"));
    } else if (raw.status == RAW_WRITE) {
      appendUpload(kind, raw.buf, raw.currentSize);
    } else if (raw.status == RAW_END || raw.status == RAW_ABORTED) {
      endUpload(kind, raw.status == RAW_ABORTED);
    }
    return;
  }

  HTTPUpload& upload = server_.upload();
  if (upload.status == UPLOAD_FILE_START) {
    startUpload(kind, server_.arg(kind == UploadKind::kEye ? "clip_id" : "effect_id"),
                authorizeRequest(String("asset:POST:") + server_.uri() + ":single"));
  } else if (upload.status == UPLOAD_FILE_WRITE && uploadOk_) {
    appendUpload(kind, upload.buf, upload.currentSize);
  } else if (upload.status == UPLOAD_FILE_END || upload.status == UPLOAD_FILE_ABORTED) {
    endUpload(kind, upload.status == UPLOAD_FILE_ABORTED);
  }
}

